Revit 2024 API
ImportIFCOptions.LinkProcessor Property
 Specifies the engine to use while doing a Link IFC operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public string LinkProcessor { get; set; }
Visual Basic
Public Property LinkProcessor As String
	Get
	Set
Visual C++
public:
property String^ LinkProcessor {
	String^ get ();
	void set (String^ value);
}
Remarks
 This setting allows the user to revert to the legacy Revit link IFC code when linking in IFC files, to preserve old behavior. There are three supported options: Default: let Revit decide the best processor. Legacy: use only the legacy Revit Link IFC processor. AnyCAD: use AnyCAD to help Link IFC files. Any other value (or no entry) will behave as "Default".
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ImportIFCOptions Class
Autodesk.Revit.DB Namespace